/*企业发放的奖金根据利润提成。
利润低于或等于10万元时，奖金可提10%；
利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成8%；
20万到40万之间时，高于20万元的部分，可提成5%；
40万到60万之间时高于 40万元的部分，可提成3%；
60万到100万之间时，高于60万元的部分，可提成2%，
高于100万元时，超过100万元的部分按1%提成。
编写程序，输入用户当月利润，输出发放奖金总数。
*/


#define _CRT_SECURE_NO_WARNINGS

#include<stdio.h>
int main()
{
	int profit;
	(void)scanf("%d", &profit);
	if (profit <= 100000)
	{
		printf("%d", (int)(profit * 0.1));
	}
	if (profit > 100000 && profit <= 200000)
	{
		printf("%d", (int)(100000*0.1+(profit-100000)*0.08));
	}
	if (profit > 200000 && profit <= 400000)
	{
		printf("%d", (int)(100000 * 0.1 + 100000 * 0.08 + (profit - 200000) * 0.05));
	}
	if (profit > 400000 && profit <= 600000)
	{
		printf("%d", (int)(100000 * 0.1 + 100000 * 0.08 + 200000 * 0.05
			+ (profit - 40000) * 0.03));
	}
	if (profit > 600000 && profit <= 1000000)
	{
		printf("%d", (int)(100000 * 0.1 + 100000 * 0.08 + 200000 * 0.05
			+ 220000 * 0.03 + (profit - 600000) * 0.02));
	}
	if (profit > 1000000)
	{
		printf("%d", (int)(100000 * 0.1 + 100000 * 0.08 + 200000 * 0.05
			+ 20000 * 0.03 + 400000 * 0.02 + (profit - 100000) * 0.01));
	}
	return 0;
}